---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternInfo.#ctor
source: html/0c0f65cf-70bb-e187-dd13-eb67e00f5e3b.htm
---
# Autodesk.Revit.DB.ExportPatternInfo.#ctor Method

Constructs a new default ExportPatternInfo.

## Syntax (C#)
```csharp
public ExportPatternInfo()
```